Documents/Чипирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Чипирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРасходников</xr:Item>
				<xr:Item>InformationRegister.НомераМикрочипов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВетеринарноеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВетеринарныеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Микрочип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМикрочипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеЭлектронногоЧипа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмещенияЭлектронногоЧипа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиРасходников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиРасходников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Расходник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НомераМикрочипов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераМикрочипов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМикрочипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Чипирование/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Движение = Движения.ОстаткиРасходников.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Расходник = Микрочип;
	Движение.Количество = 1;
	
	Движения.ОстаткиРасходников.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРасходниковОстатки.Расходник КАК Расходник,
		|	ОстаткиРасходниковОстатки.Расходник.Представление КАК РасходникПредставление,
		|	ОстаткиРасходниковОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиРасходниковОстатки.Расходник.ЕдиницаИзмерения КАК РасходникЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.ОстаткиРасходников.Остатки(&ДатаОстатков, Расходник = &Расходник) КАК ОстаткиРасходниковОстатки
		|ГДЕ
		|	ОстаткиРасходниковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Расходник", Микрочип);
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Недостаточно микрочипов %1, не хватает: %2 %3", 
										Выборка.РасходникПредставление, -Выборка.КоличествоОстаток, Выборка.РасходникЕдиницаИзмерения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр НомераМикрочипов
	Движения.НомераМикрочипов.Записывать = Истина;
	Движение = Движения.НомераМикрочипов.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.НомерМикрочипа = НомерМикрочипа;

КонецПроцедуры
